{
  "lang": "de",
  "layouts": {
    "component": {
      "meta": {
        "title": "{componentName}",
        "description": "Übersicht über die {componentName} Komponente.",
        "categoryDescription": "Übersicht über die {componentName} Komponente. Erfahre mehr über {category}.",
        "itemDescription": "Übersicht über die {componentName} Komponente. Erfahre mehr über '{item}'-{category}.",
        "itemContentDescription": "Übersicht über die {componentName} Komponente. Erfaher mehr über '{item}'-{category}:\n{content}",
        "og": {
          "title": "{componentName} | NuxtWind",
          "locale": "de_DE"
        }
      },
      "content": {
        "playground": "Test-Bereich",
        "cycleTheme": {
          "tooltip": "Thema ändern"
        },
        "switchLocale": {
          "tooltip": "Sprache ändern"
        },
        "github": {
          "tooltip": "Auf Github öffnen"
        }
      },
      "function": {
        "themeSwitch": {
          "message": "Designwechsel zu: {theme}"
        },
        "localeSwitch": {
          "title": "Sprache",
          "message": "Sprache auf {locale} umgestellt"
        }
      }
    }
  },
  "pages": {
    "404": {
      "meta": {
        "title": "404",
        "description": "Seite nicht gefunden",
        "og": {
          "title": "404 - Seite nicht gefunden | NuxtWind",
          "locale": "de_DE"
        }
      },
      "content": {
        "errorMessage": "Hoppla! Diese Seite existiert nicht.",
        "urlDisplay": "Sie haben versucht auf <a class='text-primary-800 hover:text-secondary-800' href='{path}'>{path}</a> zuzugreifen."
      },
      "buttons": {
        "home": "Zurück zur Startseite"
      }
    },
    "index": {
      "meta": {
        "title": "Home",
        "description": "NuxtWind Komponenten Sammlung - Gemacht für Nuxt 3. Erstellt mit TailwindCSS. Inspiriert von Vuetify.",
        "og": {
          "title": "NuxtWind",
          "locale": "de_DE"
        }
      },
      "content": {
        "nuxtwind": "NuxtWind Komponenten Sammlung",
        "description": "Gemacht für Nuxt 3. Erstellt mit TailwindCSS. Inspiriert von Vuetify."
      },
      "buttons": {
        "getStarted": "Loslegen",
        "documentation": "Dokumentation"
      }
    },
    "fallbackIndex": {
      "meta": {
        "title": "Hoppla",
        "description": "Wir konnten deine Sprache nicht feststellen.",
        "og": {
          "title": "Hoppla - Sprache nicht gefunden | NuxtWind",
          "locale": "de_DE"
        }
      },
      "content": {
        "oops": "Hoppla",
        "errorMessage": "Wir konnten deine Sprache nicht feststellen. Bitte wähle eine aus."
      },
      "buttons": {
        "english": "Englisch",
        "german": "Deutsch"
      }
    },
    "component": {
      "textfield": {
        "content": {
          "documentation": {
            "properties": {
              "color": {
                "description": "Eigenschaft zum Festlegen der Farben des Textfelds.<br>Sie können den Hintergrund, den Text, den Hinweis, den Fehler, die Beschriftung, die fokussierte Beschriftung, den Platzhalter, das Symbol, das fokussierte Symbol, den Rahmen, den fokussierten Rahmen, den Fehlerrahmen und die Farbe des fokussierten Fehlerrahmens separat festlegen. \n<br>Wenn das 'outlined' Prop gesetzt ist, ist die Hintergrundfarbe transparent.<br>Denken Sie daran, <span class='font-bold'>die Modifikatorklassen für spezielle Zustände so zu belassen</span>, wie sie in der Standardeinstellung sind, \nund nur die Farbklassen ändern."
              },
              "label": {
                "description": "Eigenschaft um die Bezeichnung des Textfelds festzulegen. \nWird für das Validierungsereignis verwendet. \nDies sollte festgelegt und ein eindeutiger Wert sein. \nWenn der Label-Slot verwendet wird, wird die Label-Eigenschaft weiterhin für das Validierungsereignis verwendet."
              },
              "rounded": {
                "description": "Eigenschaft um den Randradius des Textfeldes festzulegen. \nDies gilt nur für das Textfeld, wenn der 'outlined' Prop gesetzt ist.<br>Der Standardwert kann durch einen String oder 'false' ersetzt werden.<br>Um einen speziellen Wert einzustellen, stelle ihn auf eine Tailwind \n'rounded'-Klasse."
              },
              "prependIcon": {
                "description": "Eigenschaft um den Platzhalter zu aktivieren, der ein Symbol vor dem Textfeld enthält. Es kann auch eine Komponente als Objekt übergeben werden anstatt den Slot zu verwenden.<br> Das Symbol wird innerhalb des Textfelds angezeigt und linksbündig ausgerichtet."
              },
              "appendIcon": {
                "description": "Eigenschaft um den Platzhalter zu aktivieren, der ein Symbol am Ende des Textfelds enthält. Es kann auch eine Komponente als Objekt übergeben werden anstatt den Slot zu verwenden.<br> Das Symbol wird innerhalb des Textfelds angezeigt und rechtsbündig ausgerichtet."
              },
              "disabled": {
                "description": "Eigenschaft um das Textfeld zu deaktivieren. \nWenn deaktiviert, wird die Deckkraft auf 50 % gesetzt und das Textfeld ist nicht mehr anklickbar."
              },
              "loading": {
                "description": "Eigenschaft um den Ladezustand des Textfeldes zu setzen. \nWenn sie angewendet wird, pulsiert das Textfeld und ein Ladecursor wird beim darüberschweben angezeigt."
              },
              "outlined": {
                "description": "Eigenschaft um den Stil des Textfelds auf 'umrissen' zu setzen. \nWenn gesetzt, wird der Rahmen auf den Standardwert gesetzt.<br>Über eine Tailwind 'border'-Klasse kann die Rahmenbreite gesetzt werden.<br>Die Hintergrundfarbe ist transparent."
              },
              "filled": {
                "description": "Eigenschaft um den Stil des Textfelds auf 'ausgefüllt' zu setzen. \nWenn gesetzt, wird die Border-Klasse auf den Default-Wert gesetzt.<br>Wenn eine Tailwind-'border'-Klasse übergeben wird, wird die Border-Breite gesetzt.<br>Für das beste Erscheinungsbild sollte eine 'border-t'-Klasse verwendet werden."
              },
              "shadow": {
                "description": "Eigenschaft um dem Textfeld einen Schatten hinzuzufügen. \nDer Standardwert wird angewendet, wenn die Eigenschaft angewendet wird und keine Tailwind-Klasse übergeben wird. Übergibt man eine \"Shadow\"-Klasse kann der Effekt angepasst werden."
              },
              "transition": {
                "description": "Eigenschaft um die Übergangseinstellungen des Textfelds und des Platzhalters festzulegen.<br>Wenn auf „true“ gesetzt, wird der Standardübergang angewendet.<br>Wenn ein Objekt übergeben wird, kann die „Dauer“ und der „Übergang“ unabhängig von einander für jeweils die regulären und die Platzhalter Übergänge angepasst werden."
              },
              "placeholder": {
                "description": "Eigenschaft um den Platzhalter des Textfeldes zu setzen."
              },
              "hint": {
                "description": "Eigenschaft um den Hinweis des Textfeldes zu setzen."
              },
              "type": {
                "description": "Eigenschaft um den Typ des Textfelds festzulegen."
              },
              "width": {
                "description": "Eigenschaft um die Breite des Textfeldes festzulegen. Die Breite kann mit Tailwind \"W\"-Klassen angepasst werden."
              },
              "autocomplete": {
                "description": "Eigenschaft um den Autocomplete-Wert der Eingabe festzulegen."
              }
            },
            "events": {
              "updateModelValue": {
                "description": "Ereignis, das bei jeder Eingabe den Wert des Textfeldes ausgibt. \nDieses Ereignis wird verwendet, um v-model zu aktualisieren."
              },
              "updateValidation": {
                "description": "Ereignis, das den Validierungsstatus des Textfelds ausgibt. \nDieses Ereignis kann verwendet werden, um die Validierung der Komponente im übergeordneten Element zu überprüfen."
              },
              "focusIn": {
                "description": "Ereignis, das ausgegeben wird, wenn das Textfeld fokussiert wurde."
              },
              "focusOut": {
                "description": "Ereignis, das ausgegeben wird, wenn das Textfeld den Fokus verliert."
              }
            },
            "slots": {
              "label": {
                "description": "Slot zum Anpassen der Standardbeschriftung des Textfelds."
              },
              "prependIcon": {
                "description": "Platzhalter zum Hinzufügen eines Symbols vor dem Textfeld. \nDas Symbol wird im Textfeld angezeigt und linksbündig ausgerichtet. \nDie Eigenschaft „prepend-icon“ ist erforderlich, um das Symbol anzuwenden."
              },
              "appendIcon": {
                "description": "Platzhalter zum Hinzufügen eines Symbols hinter dem Textfeld. \nDas Symbol wird im Textfeld angezeigt und rechtsbündig ausgerichtet. \nDie Eigenschaft „append-icon“ ist erforderlich, um das Symbol anzuwenden."
              }
            }
          },
          "playground": {
            "toggleLoadingButton": "Laden umschalten",
            "checkboxgroup": {
              "label": "Bool-Eigenschaften Auswahl",
              "description": "Durch Aktivieren oder Deaktivieren der Kontrollkästchen werden die Eigenschaften entsprechend angewandt."
            }
          }
        }
      },
      "textarea": {
        "content": {
          "playground": {
            "checkboxgroup": {
              "label": "Bool-Eigenschaften Auswahl",
              "description": "Durch Aktivieren oder Deaktivieren der Kontrollkästchen werden die Eigenschaften entsprechend angewandt."
            }
          },
          "documentation": {
            "properties": {
              "color": {
                "description": "Eigenschaft zum Festlegen der Farben der Textbox.<br>Sie können den Hintergrund, den Text, den Hinweis, den Fehler, die Beschriftung, die fokussierte Beschriftung, den Platzhalter, das Symbol, das fokussierte Symbol, den Rahmen, den fokussierten Rahmen, den Fehlerrahmen und die Farbe des fokussierten Fehlerrahmens separat festlegen. \n<br>Wenn das 'outlined' Prop gesetzt ist, ist die Hintergrundfarbe transparent.<br>Denken Sie daran, <span class='font-bold'>die Modifikatorklassen für spezielle Zustände so zu belassen</span>, wie sie in der Standardeinstellung sind, \nund nur die Farbklassen ändern."
              },
              "label": {
                "description": "Eigenschaft um die Bezeichnung der Textbox festzulegen. \nWird für das Validierungsereignis verwendet. \nDies sollte festgelegt und ein eindeutiger Wert sein. \nWenn der Label-Slot verwendet wird, wird die Label-Eigenschaft weiterhin für das Validierungsereignis verwendet."
              },
              "rounded": {
                "description": "Eigenschaft um den Randradius der Textbox festzulegen. \nDies gilt nur für die Textbox, wenn die 'outlined' Eigenschaft gesetzt ist.<br>Der Standardwert kann durch einen String oder 'false' ersetzt werden.<br>Um einen speziellen Wert einzustellen, stelle ihn auf eine Tailwind \n'rounded'-Klasse."
              },
              "prependIcon": {
                "description": "Eigenschaft um den Platzhalter zu aktivieren, der ein Symbol vor der Textbox enthält. Es kann auch eine Komponente als Objekt übergeben werden anstatt den Slot zu verwenden.<br> Das Symbol wird innerhalb der Textbox angezeigt und linksbündig ausgerichtet."
              },
              "appendIcon": {
                "description": "Eigenschaft um den Platzhalter zu aktivieren, der ein Symbol am Ende der Textbox enthält. Es kann auch eine Komponente als Objekt übergeben werden anstatt den Slot zu verwenden.<br> Das Symbol wird innerhalb der Textbox angezeigt und rechtsbündig ausgerichtet."
              },
              "disabled": {
                "description": "Eigenschaft um die Textbox zu deaktivieren. \nWenn deaktiviert, wird die Deckkraft auf 50 % gesetzt und die Textbox ist nicht mehr anklickbar."
              },
              "loading": {
                "description": "Eigenschaft um den Ladezustand der Textbox zu setzen. \nWenn sie angewendet wird, pulsiert die Textbox und ein Ladecursor wird beim darüberschweben angezeigt."
              },
              "outlined": {
                "description": "Eigenschaft um den Stil der Textbox auf 'outlined' zu setzen. \nWenn gesetzt, wird der Rahmen auf den Standardwert gesetzt.<br>Über eine Tailwind 'border'-Klasse kann die Rahmenbreite gesetzt werden.<br>Die Hintergrundfarbe ist transparent."
              },
              "filled": {
                "description": "Eigenschaft um den Stil der Textbox auf 'filled' zu setzen. \nWenn gesetzt, wird die Border-Klasse auf den Default-Wert gesetzt.<br>Wenn eine Tailwind-'border'-Klasse übergeben wird, wird die Border-Breite gesetzt.<br>Für das beste Erscheinungsbild sollte eine 'border-t'-Klasse verwendet werden."
              },
              "shadow": {
                "description": "Eigenschaft um der Textbox einen Schatten hinzuzufügen. \nDer Standardwert wird angewendet, wenn die Eigenschaft angewendet wird und keine Tailwind-Klasse übergeben wird. Übergibt man eine \"Shadow\"-Klasse kann der Effekt angepasst werden."
              },
              "transition": {
                "description": "Eigenschaft um die Übergangseinstellungen der Textbox und des Platzhalters festzulegen.<br>Wenn auf „true“ gesetzt, wird der Standardübergang angewendet.<br>Wenn ein Objekt übergeben wird, kann die „Dauer“ und der „Übergang“ unabhängig von einander für jeweils die regulären und die Platzhalter Übergänge angepasst werden."
              },
              "placeholder": {
                "description": "Eigenschaft um den Platzhalter der Textbox zu setzen."
              },
              "hint": {
                "description": "Eigenschaft um den Hinweis der Textbox zu setzen."
              },
              "height": {
                "description": "Eigenschaft um die Höhe der Textbox festzulegen. Die Höhe kann mit Tailwind \"H\"-Klassen angepasst werden."
              },
              "width": {
                "description": "Eigenschaft um die Breite der Textbox festzulegen. Die Breite kann mit Tailwind \"W\"-Klassen angepasst werden."
              },
              "autocomplete": {
                "description": "Eigenschaft um den Autocomplete-Wert der Textbox festzulegen."
              },
              "counter": {
                "description": "Eigenschaft um einen Zähler in der oberen rechten Ecke der Textbox anzuzeigen, der die eingegebenen Zeichen zählt."
              }
            },
            "events": {
              "updateModelValue": {
                "description": "Ereignis, das bei jeder Eingabe den Wert der Textbox ausgibt. \nDieses Ereignis wird verwendet, um v-model zu aktualisieren."
              },
              "updateValidation": {
                "description": "Ereignis, das den Validierungsstatus der Textbox ausgibt. \nDieses Ereignis kann verwendet werden, um die Validierung der Komponente im übergeordneten Element zu überprüfen."
              },
              "focusIn": {
                "description": "Ereignis, das ausgegeben wird, wenn die Textbox fokussiert wurde."
              },
              "focusOut": {
                "description": "Ereignis, das ausgegeben wird, wenn die Textbox den Fokus verliert."
              }
            },
            "slots": {
              "label": {
                "description": "Slot zum Anpassen der Standardbeschriftung der Textbox."
              },
              "prependIcon": {
                "description": "Platzhalter zum Hinzufügen eines Symbols vor der Textbox. \nDas Symbol wird in der Textbox angezeigt und linksbündig ausgerichtet. \nDie Eigenschaft „prepend-icon“ ist erforderlich, um das Symbol anzuwenden."
              },
              "appendIcon": {
                "description": "Platzhalter zum Hinzufügen eines Symbols hinter der Textbox. \nDas Symbol wird in der Textbox angezeigt und rechtsbündig ausgerichtet. \nDie Eigenschaft „append-icon“ ist erforderlich, um das Symbol anzuwenden."
              }
            }
          }
        }
      },
      "button": {
        "content": {
          "documentation": {
            "slots": {
              "default": {
                "description": "Platzhalter zum Festlegen des Inhalts der Schaltfläche."
              }
            },
            "properties": {
              "rounded": {
                "description": "Eigenschaft um den Randradius der Schaltfläche festzulegen. \nDer Standardwert kann aktiviert werden, indem die Eigenschaft gesetzt wird, oder deaktiviert werden, indem sie auf 'false' gesetzt wird.<br>Um einen speziellen Wert festzulegen, kann eine Tailwind' rounded'-Klasse übergeben werden."
              },
              "color": {
                "description": "Eigenschaft um die Farbe des Buttons festzulegen.<br>Die Hintergrund-, Text-, Rand- und Hover-Farbe kann separat festgelegt werden.<br>Wenn die 'outlined'-Eigenschaft gesetzt ist, werden nur der Rand und die Textfarbe verwendet.< \nbr>Wenn die Eigenschaft „disabled“ oder „loading“ gesetzt ist, wird die Deckkraft auf 50 % gesetzt und die Hover-Farbe wird nicht mehr wirksam.<br>Wenn die Eigenschaft „icon“ gesetzt ist, wird nur die Text und iconHover-Farbe angewandt."
              },
              "grow": {
                "description": "Eigenschaft um einen Wachstumseffekt auf die Schaltfläche anzuwenden. \nDie Verzögerung und die Skalierung können separat eingestellt werden.<br>Um den Effekt beim Schweben anzuwenden, stellen Sie der Tailwind-'scale'-Klasse 'hover:' voran."
              },
              "link": {
                "description": "Eigenschaft um die Schaltfläche zu einem Link zu machen. \nEs kann entweder eine vollständige oder eine relative URL übergeben werden."
              },
              "target": {
                "description": "Eigenschaft um das Ziel des Links festzulegen. \nWird nur angewendet, wenn die Eigenschaft „Link“ gesetzt ist."
              },
              "disabled": {
                "description": "Eigenschaft um die Schaltfläche zu deaktivieren. \nWenn deaktiviert, wird die Deckkraft auf 50 % gesetzt und die Hover-Farbe ist nicht mehr wirksam.<br>Die Schaltfläche kann nicht mehr angeklickt werden.<br>Auch der Wachstumseffekt ist nicht mehr wirksam."
              },
              "icon": {
                "description": "Eigenschaft um die Schaltfläche auf eine Symbolschaltfläche zu ändern. \nWenn gesetzt, werden nur die Text- und Hover-Farben wirksam."
              },
              "loading": {
                "description": "Eigenschaft um die Schaltfläche auf Laden zu setzen. \nBeim Laden wird die Deckkraft auf 50% gesetzt und die Hover-Farbe wird nicht mehr wirksam.<br>Die Schaltfläche ist nicht mehr anklickbar.<br>Auch der Grow-Effekt tritt nicht mehr in Kraft. \nAnstelle des Schaltflächeninhalts wird ein Ladespinner angezeigt."
              },
              "outlined": {
                "description": "Eigenschaft um die Schaltfläche auf 'umrissen' zu setzen. \nWenn gesetzt, wird der Rahmen auf den Standardwert gesetzt.<br>Wenn eine Tailwind-'Border'-Klasse übergeben wird, kann die Rahmenbreite gesetzt werden.<br>Die Hintergrundfarbe ist transparent.<br>Auch \nDie Hover-Farbe wird nicht mehr wirksam. \nStattdessen werden die Rahmen- und Textfarbe angewendet."
              },
              "shadow": {
                "description": "Eigenschaft um der Schaltfläche einen Schatten hinzuzufügen. \nDer Standardwert kann aktiviert werden, indem die Eigenschaft gesetzt wird, oder deaktiviert werden, indem sie auf \"false\" gesetzt wird. \nUm einen speziellen Wert einzustellen, kann eine Tailwind-'shadow'-Klasse übergeben werden."
              },
              "transition": {
                "description": "Eigenschaft um die Übergangseinstellungen der Schaltfläche festzulegen, die sich auf die Hover-Farbänderung und die Grow-Eigenschaft auswirken.<br>Bei Einstellung auf „false“ wird kein Übergang angewendet.<br>Bei Einstellung auf „true“ wird der \nStandardübergang angewendet.<br>Bei Einstellung auf ein Objekt kann die 'Dauer' und der 'Übergang' separat eingestellt werden."
              },
              "dense": {
                "description": "Eigenschaft um die Höhe der Schaltfläche zu redizieren. \nWenn auf true gesetzt, wird das Padding reduziert und der Text klein."
              },
              "width": {
                "description": "Eigenschaft um die Breite der Schaltfläche festzulegen. \nEs kann eine Tailwind \"w\"-Klasse übergeben werden."
              },
              "height": {
                "description": "Eigenschaft um die Höhe der Schaltfläche festzulegen. \nEs kann eine Tailwind \"h\"-Klasse übergeben werden."
              }
            },
            "caveats": {
              "progress": {
                "description": "Die Button-Komponente erfordert die <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">Progress-Komponente</a>.",
                "title": "Progress Komponente"
              }
            }
          },
          "playground": {
            "textfield": {
              "initialValue": "Klick mich!"
            },
            "checkboxgroup": {
              "label": "Bool-Eigenschaften Auswahl",
              "description": "Durch Aktivieren oder Deaktivieren der Kontrollkästchen werden die Eigenschaften entsprechend angewandt.",
              "items": {
                "grow": {
                  "description": "Gilt nur für nicht mobile Geräte."
                }
              }
            }
          }
        }
      },
      "progress": {
        "content": {
          "documentation": {
            "properties": {
              "size": {
                "description": "Gilt nur für die lineare Variante. \nEigenschaft um die Abmessungen der Komponente festzulegen."
              },
              "color": {
                "description": "Prop, um die Farben der Komponente festzulegen. \nFür die lineare Variante können folgende Farben separat eingestellt werden: Hintergrund, erster Animationsstrich, zweiter Animationsstrich, Fortschrittsfarbe und Hover-Fortschritt.<br>Für die kreisförmige Variante: Kreis, Fortschrittsfarbe und die Farbe des inneren Ausschnitts."
              },
              "circular": {
                "description": "Eigenschaft um die Komponente auf die kreisförmige Variante einzustellen. \nDie kreisförmige Variante kann angepasst werden, indem sie auf ein Objekt mit den folgenden Eigenschaften gesetzt wird:<br><span class='font-bold'>Breite</span>: Kann auf jede Tailwind 'w'-Klasse gesetzt werden.<br \n><span class='font-bold'>Höhe</span>: Kann auf jede Tailwind 'h'-Klasse eingestellt werden.<br><span class='font-bold'>cutout.width</span>: \nKann auf jede Tailwind 'w'-Klasse in Kombination mit dem 'before'-Modifier gesetzt werden.<br><span class='font-bold'>cutout.height</span>: Kann auf jede Tailwind 'h'-Klasse in Kombination mit dem 'before'-Modifier gesetzt werden.<br><span class='font-bold'>cutout.text</span>: Kann auf jede Tailwind 'Text'-Klasse gesetzt werden, um die Textgröße festzulegen."
              },
              "loading": {
                "description": "Eigenschaft um den Ladezustand der Komponente festzulegen."
              },
              "initialLoadTime": {
                "description": "Diese Eigenschaft verhält sich je nach gewählter Variante unterschiedlich.<br><span class='font-bold'>Linear</span>: Die Zeit in ms zwischen der Erstellung der Komponente und der tatsächlichen Anzeige des Fortschritts. \nFür den besten Effekt sollte das Transition-Prop aktiv sein.<br><span class='font-bold'>Circular</span>: Die Zeit in ms, die die Komponente benötigt, um den angegebenen Wert zu erreichen."
              },
              "rounded": {
                "description": "Gilt für die lineare Variante. \nEigenschaft um den Randradius der Komponente festzulegen. \nKann deaktiviert werden, indem es auf „false“ gesetzt wird, oder angepasst werden, indem die Eigenschaft auf eine Tailwind „rounded“-Klasse eingestellt wird."
              },
              "initialLoadTimeType": {
                "description": "Eigenschaft um festzulegen, wie die Wachstumsgeschwindigkeit des kreisförmigen Fortschritts interpretiert wird.<br>Gültige Optionen sind:<br><span class='font-bold'>calc</span>: Die Geschwindigkeit wird \nfür jeden Wachstum einzeln berechnet, wodurch jeder Wachstum die gleiche Geschwindigkeit hat.<br><span class='font-bold'>static</span>: Die Geschwindigkeit wird auf den angegebenen Wert gesetzt. \nJeder einzelne Schritt dauert gleich lange."
              }
            },
            "slots": {
              "innerCircle": {
                "description": "Platzhalter zum Anpassen des inneren Kreisbereichs bei der kreisförmigen Variante."
              }
            },
            "config": {
              "linearAnimation": {
                "name": "Lineare Lade-Animation",
                "description": "Damit die lineare Ladeanimation richtig funktioniert, muss die Tailwind-Konfiguration um die angezeigten Optionen erweitert werden."
              }
            },
            "caveats": {
              "resolveConfig": {
                "title": "Tailwind-Farben in Hex-Farben auflösen",
                "description": "Da die Komponente Hex-Farben für zusätzliches benutzerdefiniertes CSS benötigt, ist es möglich die Tailwind-Farbe in einen Hex-Farbcode aufzulösen, indem man <a class='font-bold underline text-primary-800 hover:text-secondary-700' href=' verwenden. \n{url}' target='_blank'>diese Methode</a> nutzt."
              }
            }
          },
          "playground": {
            "checkboxgroup": {
              "label": "Bool-Eigenschaften Auswahl",
              "description": "Durch Aktivieren oder Deaktivieren der Kontrollkästchen werden die Eigenschaften entsprechend angewandt.",
              "items": {
                "rounded": {
                  "description": "Gilt nur für die lineare Variante."
                }
              }
            },
            "valueText": {
              "label": "Wert"
            }
          }
        }
      },
      "toast": {
        "content": {
          "playground": {
            "titleTextfield": {
              "label": "Titel",
              "placeholder": "Beispiel: 'Warnung!'",
              "hint": "Titel der Benachrichtigung",
              "default": "Test-Benachrichtigung"
            },
            "messageTextfield": {
              "label": "Nachricht",
              "placeholder": "Beispiel: 'Dies ist eine Nachricht'",
              "hint": "Nachricht der Benachrichtigung",
              "default": "Dies ist eine Testbenachrichtigung"
            },
            "durationTextfield": {
              "label": "Dauer",
              "placeholder": "Beispiel: '5'",
              "hint": "Dauer der Benachrichtigung"
            },
            "rule": {
              "notEmpty": "Dieses Feld ist erforderlich",
              "isNumber": "Der Wert muss eine Zahl sein",
              "maxVal": "Der Wert muss kleiner oder gleich {max} sein"
            }
          },
          "documentation": {
            "properties": {
              "id": {
                "description": "Prop, um die ID der Benachrichtigung festzulegen. \nErforderlich und muss eindeutig sein."
              },
              "autoClose": {
                "description": "Eigenschaft zum Aktivieren oder Deaktivieren des automatischen Schließens der Benachrichtigung nach einer bestimmten Dauer."
              },
              "color": {
                "description": "Eigenschaft um die Farben der Benachrichtigung festzulegen. \nDie Farbe des Texts und den Hintergrunds für die Benachrichtigung selbst und für jeden Typ kann individuell festgelegt werden."
              },
              "duration": {
                "description": "Dauer, die der Toast angezeigt wird. \nGilt wenn „autoClose“ auf „true“ gesetzt ist."
              },
              "rounded": {
                "description": "Eigenschaft um den Randradius der Benachrichtigung festzulegen. \nKann entweder mit einem booleschen Wert umgeschaltet oder durch Übergabe einer beliebigen Tailwind 'rounded' Klasse angegeben werden."
              },
              "type": {
                "description": "Einstellen des Benachrichtigung-Typs. \nKann eines der Folgenden sein: info, warning, error, success."
              },
              "title": {
                "description": "Einstellung um den Titel der Benachrichtigung festzulegen."
              },
              "message": {
                "description": "Einstellung um die Nachricht der Benachrichtigung festzulegen."
              },
              "shadow": {
                "description": "Eigenschaft um den Schatten der Benachrichtigung festzulegen. \nKann auf jede Tailwind 'shadow'-Klasse eingestellt werden."
              },
              "width": {
                "description": "Eigenschaft um die Breite der Benachrichtigung einzustellen. \nKann auf jede Tailwind \"w\"-Klasse eingestellt werden."
              }
            },
            "caveats": {
              "icon": {
                "title": "Unplugin Icons Paket",
                "description": "Das Symbol auf der Benachrichtigung ändert sich entsprechend dem eingestellten Typ. \nDie angezeigten Icons stammen aus dem <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" href=\"{url}\" target=\"_blank\">Unplugin-Icons-Paket</a>."
              },
              "button": {
                "title": "Button Komponente",
                "description": "Die Benachrichtigungs-Komponente erfordert die <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">Button-Komponente</a>."
              },
              "progress": {
                "title": "Progress Komponente",
                "description": "Die Benachritigungs-Komponente erfordert die <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">Progress-Komponente</a>. \nSie wird zum Anzeigen der Zeitleiste verwendet, wenn die AutoClose-Eigenschaft aktiviert ist."
              }
            },
            "events": {
              "close": {
                "description": "Ereignis, das ausgelöst wird, wenn die Benachrichtigung geschlossen wird. Entweder durch das klicken des 'x' oder nach dem ablauf des autoClose-Timers."
              },
              "autoClose": {
                "description": "Ereignis, das ausgegeben wird, wenn der Toast aufgrund eines autoClose-Timers geschlossen wird."
              }
            }
          }
        }
      },
      "select": {
        "content": {
          "documentation": {
            "properties": {
              "referComponent": {
                "textfield": {
                  "description": "Diese Eigenschaft wird nur auf die integrierte Textfeldkomponente angewandet. \n<a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">Mehr</a> über das Verhalten der Eigenschaft."
                }
              },
              "items": {
                "description": "Eigenschaft um die Elemente der Select-Komponente zu füllen."
              },
              "color": {
                "description": "Eigenschaft um die Farbe für den Hintergrund, den Text, den Rahmen und die Hover-Farbe des Dropdown-Menüs festzulegen, das beim Klicken auf das Auswahlfeld angezeigt wird. \nMit einem verschachtelten 'textfield'-Objekt können die Farben des Textfeldes selbst eingestellt werden. \n<a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">Weitere</a> Informationen zur Textfeld-Color-Prop."
              },
              "search": {
                "description": "Eigenschaft um das Dropdown-Menü des Auswahlfelds zu senken und ein Suchfeld anzuzeigen, um die Elemente des Select-Feldes zu filtern."
              },
              "disabled": {
                "description": "Eigenschaft um das Auswahlfeld zu deaktivieren. \nDas Dropdown wird nicht mehr angezeigt, wenn diese Eigenschaft gesetzt ist. \nAuch die Effekte der <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">'disabled'-Eigenschaft</a> des Textfeldes werden angewendet."
              },
              "loading": {
                "description": "Eigenschaft um den Ladestatus des ausgewählten Felds festzulegen. \nDas Dropdown wird nicht mehr angezeigt, wenn diese Eigenschaft gesetzt ist. \nAuch die Auswirkungen der <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">'loading'-Eigenschaft</a> des Textfelds werden angewendet."
              },
              "width": {
                "description": "Eigenschaft um die Breite des Auswahl-Dropdowns festzulegen. \nDie Breite des Textfeldes kann ebenfalls eingestellt werden."
              },
              "height": {
                "description": "Eigenschaft um die Höhe des Auswahl-Dropdowns festzulegen."
              }
            },
            "slots": {
              "referComponent": {
                "textfield": {
                  "description": "Dieser Platzhalter leitet nur auf den gleichnamigen Platzhalter der 'textfield'-Komponente um. \n<a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">Weitere</a> Informationen darüber."
                }
              }
            },
            "caveats": {
              "textfield": {
                "title": "Textfield Komponente",
                "description": "Die Select-Komponente erfordert die <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">Textfield-Komponente</a>."
              }
            }
          },
          "playground": {
            "checkboxgroup": {
              "label": "Bool-Eigenschaften Auswahl",
              "description": "Durch Aktivieren oder Deaktivieren der Kontrollkästchen werden die Eigenschaften entsprechend angewandt."
            }
          }
        }
      },
      "checkbox": {
        "content": {
          "documentation": {
            "properties": {
              "color": {
                "description": "Eigenschaft um die Farbe der folgenden Teile der Chechbox-Komponente festzulegen: Label, Description, IconInactive, IconActive und Hover."
              },
              "label": {
                "description": "Eigenschaft um den Beschriftungstext der Checkbox festzulegen."
              },
              "description": {
                "description": "Eigenschaft um die Beschreibung der Checkbox festzulegen."
              },
              "text": {
                "description": "Eigenschaft um die Textdarstellung des Labels und der Beschreibung zu ändern."
              },
              "disabled": {
                "description": "Eigenschaft um die Checkbox zu deaktivieren."
              },
              "loading": {
                "description": "Eigenschaft um den Ladezustand der Checkbox festzulegen."
              },
              "radio": {
                "description": "Eigenschaft, die die Symbole in runde ändert."
              }
            },
            "slots": {
              "label": {
                "description": "Platzhalter zum Ändern des Standardaarstellung der Beschriftung der Checkbox."
              },
              "description": {
                "description": "Platzhalter zum Ändern des Standard-Erscheinungsbilds der Beschreibung des Kontrollkästchens."
              }
            },
            "caveats": {
              "icon": {
                "title": "Unplugin Icons Paket",
                "description": "Das Symbol der Checkbox ändert sich passend zum Wert der Checkbox. \nDie angezeigten Icons stammen aus dem <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" href=\"{url}\" target=\"_blank\">Unplugin-Icons-Paket</a>."
              },
              "group": {
                "title": "Checkbox Gruppen",
                "description": "Zur besseren Handhabung von Gruppen von Checkboxen gibt es die <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" href=\"{url}\" target=\"_blank\">'Checkboxgroup' \n-Komponente</a>."
              }
            }
          },
          "playground": {
            "checkboxgroup": {
              "label": "Bool-Eigenschaften Auswahl",
              "description": "Durch Aktivieren oder Deaktivieren der Kontrollkästchen werden die Eigenschaften entsprechend angewandt."
            },
            "textfieldDescription": {
              "label": "Checkbox Beschreibung"
            }
          }
        }
      },
      "checkboxgroup": {
        "content": {
          "documentation": {
            "properties": {
              "color": {
                "description": "Eigenschaft um die Farbe des Labels und die Beschreibung der Checkboxgruppe individuell einzustellen."
              },
              "text": {
                "description": "Eigenschaft zum Ändern des Aussehens des Labels und der Beschreibung der Checkboxgroup-Kompon.ente"
              },
              "label": {
                "description": "Eigenschaft um die Beschreibung der Checkboxgruppe Titel."
              },
              "description": {
                "description": "Eigenschaft um die Beschreibung der Checkboxgruppe festzulegen."
              },
              "items": {
                "description": "Eigenschaft um die Elemente der Gruppe festzulegen. \nDie Elemente müssen Objekte sein, die gültige Eigenschaften für die Checkbox-Komponente enthalten. \nLesen Sie <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">mehr</a> darüber."
              },
              "multiple": {
                "description": "Eigenschaft, die es ermöglicht mehrere Kontrollkästchen gleichzeitig auszuwählen. \nWenn nicht gesetzt, lässt die Gruppe jeweils nur ein aktiviertes Kästchen zu. \nAußerdem werden die Symbole in abgerundete geändert. \nDies kann durch Setzen der 'no-radio'-Eigenschaft geändert werden."
              },
              "loading": {
                "description": "Eigenschaft um den Ladezustand der Komponente festzulegen."
              },
              "disabled": {
                "description": "Eigenschaft zum Deaktivieren der Checkboxgroup."
              },
              "width": {
                "description": "Eigenschaft um die Breite der Checkbox-Gruppe zu ändern."
              },
              "generalCheckboxProps": {
                "description": "Eigenschadt um einfach dieselben Eigenschaften für mehrere Kontrollkästchen festzulegen. \n<a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">Mehr</a> über mögliche Eigenschaften."
              },
              "notZero": {
                "description": "Eigenschaft um sicherzustellen, dass mindestens ein Kontrollkästchen aktiviert ist."
              }
            },
            "slots": {
              "groupLabel": {
                "description": "Platzhalter für das Label der Checkboxgruppe."
              },
              "groupDescription": {
                "description": "Platzhalter für die Beschreibung der Checkboxgruppe."
              }
            },
            "caveats": {
              "checkbox": {
                "title": "Checkbox Komponente",
                "description": "Die Checkboxgroup-Komponente erfordert die <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" target='_blank' href=\"{url}\">Checkbox-Komponente</a>."
              }
            }
          },
          "playground": {
            "textfieldDescription": {
              "label": "Checkbox Beschreibung"
            },
            "checkboxgroup": {
              "label": "Bool-Eigenschaften Auswahl",
              "description": "Durch Aktivieren oder Deaktivieren der Kontrollkästchen werden die Eigenschaften entsprechend angewandt."
            }
          }
        }
      },
      "appbar": {
        "content": {
          "playground": {
            "checkboxgroup": {
              "label": "Bool-Eigenschaften Auswahl",
              "description": "Durch Aktivieren oder Deaktivieren der Kontrollkästchen werden die Eigenschaften entsprechend angewandt.",
              "item": {
                "shrinkOnScroll": {
                  "description": "Benötigt 'extension'-Eigenschaft"
                },
                "elevateOnScroll": {
                  "description": "Benötigt Position „fixed“ oder „sticky“."
                },
                "bottom": {
                  "description": "Benötigt Position 'absolut' oder 'fixed'"
                }
              }
            }
          },
          "documentation": {
            "properties": {
              "color": {
                "description": "Eigenschaft um die Farbe der Appbar festzulegen."
              },
              "fixed": {
                "description": "Eigenschaft um die Position der Appbar auf „fixed“ zu setzen."
              },
              "absolute": {
                "description": "Eigenschaft um die Position der Appbar auf „absolut“ zu setzen."
              },
              "sticky": {
                "description": "Eigenschaft um die Position der Appbar auf „sticky“ zu setzen."
              },
              "bottom": {
                "description": "Eigenschaft um die Position der Appbar nach unten zu ändern. \nErfordert Position 'absolut' oder 'fixed'."
              },
              "extension": {
                "description": "Eigenschaft um den Erweiterungsplatzhalter zu aktivieren, der zusätzlichen Platz unter der Appbar bietet."
              },
              "shrinkOnScroll": {
                "description": "Eigenschaft um den Erweiterungsplatzhalter beim Scrollen zu verkleinern."
              },
              "elevateOnScroll": {
                "description": "Eigenschaft um der Appbar beim Scrollen einen Schlagschatten hinzuzufügen."
              },
              "navigationIcon": {
                "description": "Eigenschaft um den Navigationssymbol-Platzhalter zu aktivieren. \nEs ist auch möglich, der Eigenschaft eine Komponente bereitzustellen. \nDas Standardsymbol ist MDI-Menü."
              },
              "scrollOffset": {
                "description": "Eigenschaft um den Y-Scroll-Offset zu setzen, wenn die Appbar in einem relativen, übergeordneten Overflow-Element verwendet wird."
              },
              "height": {
                "description": "Eigenschaft um die Höhe der Appbar festzulegen."
              },
              "zIndex": {
                "description": "Eigenschaft um den Z-Index der Appbar festzulegen."
              }
            },
            "events": {
              "navigationIconClick": {
                "description": "Ereignis, das ausgegeben wird, wenn auf das Standardnavigationssymbol geklickt wird."
              }
            },
            "slots": {
              "navigationIcon": {
                "description": "Platzhalter zum Bereitstellen eines benutzerdefinierten Navigationssymbols."
              }
            },
            "caveats": {
              "icon": {
                "description": "Das Standard Navigationssymbol stammt aus dem <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" href=\"{url}\" target=\"_blank\">Unplugin-Icons-Paket</a>.",
                "title": "Unplugins Icon Paket"
              },
              "button": {
                "title": "Button Komponente",
                "description": "Die Appbar benötigt die <a class=\"font-bold underline text-primary-800 hover:text-secondary-700\" href=\"{url}\" target=\"_blank\">Button-Komponente</a>."
              }
            }
          }
        }
      },
      "drawer": {
        "content": {
          "playground": {
            "checkboxgroup": {
              "label": "Bool-Eigenschaften Auswahl",
              "description": "Durch Aktivieren oder Deaktivieren der Kontrollkästchen werden die Eigenschaften entsprechend angewandt."
            }
          },
          "documentation": {
            "properties": {
              "color": {
                "description": "Eigenschaft um die Drawer- und Overlayfarbe einzustellen."
              },
              "absolute": {
                "description": "Eigenschaft um die Position des Drawers auf 'absolut' zu setzen."
              },
              "fixed": {
                "description": "Eigenschaft um die Position des Drawers auf 'fixed' zu setzen."
              },
              "zIndex": {
                "description": "Eigenschaft um den Z-Index des Drawers einzustellen."
              },
              "overlay": {
                "description": "Eigenschaft um das Overlay zu aktivieren oder zu deaktivieren."
              },
              "disableOverflow": {
                "description": "Eigenschaft zum Deaktivieren oder Aktivieren des Seiten-Overflows beim Öffnen des Drawers."
              },
              "expandOnHover": {
                "description": "Eigenschaft um den Drawer beim Darüberschweben zu öffnen."
              },
              "transition": {
                "description": "Eigenschaft um die Übergangseinstellungen des Drawers festzulegen. \nDauer und Ease können separat eingestellt werden."
              },
              "noMobile": {
                "description": "Eigenschaft um zu verhindern, dass der Drawer die Expand-on-Hover-Eigenschaft deaktiviert, wenn ein mobiles Gerät verwendet wird."
              },
              "mobileWidth": {
                "description": "Eigenschaft um den Schwellwert festzulegen, wann die noMobile-Eigenschaft greifen soll."
              },
              "border": {
                "description": "Eigenschaft um die Randeinstellungen des Drawers festzulegen. \nIst das 'right'-Prop eingestellt, muss das 'border'-Prop entsprechend geändert werden."
              },
              "right": {
                "description": "Eigenschaft um den Drawer auf der rechten Seite zu platzieren."
              },
              "height": {
                "description": "Eigenschaft um die Höhe des Drawers einzustellen."
              },
              "width": {
                "description": "Eigenschaft um die Breite der Schublade einzustellen."
              },
              "permanent": {
                "description": "Eigenschaft um das Schließen des Drawers beim Klicken außerhalb zu deaktivieren."
              }
            }
          }
        }
      },
      "tooltip": {
        "content": {
          "playground": {
            "checkboxgroup": {
              "label": "Bool-Eigenschaften Auswahl",
              "description": "Durch Aktivieren oder Deaktivieren der Kontrollkästchen werden die Eigenschaften entsprechend angewandt.",
              "items": {
                "interactive": {
                  "description": "Ermöglicht es über den Tooltip zu hovern."
                }
              }
            },
            "tooltip": "Dies ist ein Tooltip, der dich auffordert, nicht auf die Schaltfläche zu klicken! \n:)",
            "toast": {
              "message": "Du sollst über mir schweben und nicht klicken!"
            }
          },
          "documentation": {
            "properties": {
              "color": {
                "description": "Eigenschaft um die Farbe des Tooltips festzulegen. \nDie Farbe des Textes, des Tooltip-Hintergrunds und des Zeigerhintergrunds kann separat eingestellt werden."
              },
              "top": {
                "description": "Eigenschaft um den Tooltip über dem Inhalt zu positionieren."
              },
              "bottom": {
                "description": "Eigenschaft um den Tooltip unter dem Inhalt zu positionieren."
              },
              "left": {
                "description": "Eigenschaft um den Tooltip links vom Inhalt zu positionieren."
              },
              "right": {
                "description": "Eigenschaft um den Tooltip rechts vom Inhalt zu positionieren."
              },
              "transition": {
                "description": "Eigenschaft um die Dauer und Ease des Deckkraftübergangs festzulegen."
              },
              "text": {
                "description": "Eigenschaft um die Standard-Textdarstellung festzulegen."
              },
              "rounded": {
                "description": "Eigenschaft um den Randradius des Tooltips festzulegen oder zu deaktivieren."
              },
              "zIndex": {
                "description": "Eigenschaft um den Z-Index des Tooltips festzulegen."
              },
              "width": {
                "description": "Eigenschaft um die Breite des Tooltips festzulegen."
              },
              "interactive": {
                "description": "Eigenschaft um den Tooltip interaktiv zu machen."
              }
            },
            "slots": {
              "tooltip": {
                "description": "Platzhalter zum Einfügen des Inhalts des Tooltips."
              }
            }
          }
        }
      },
      "badge": {
        "content": {
          "playground": {
            "checkboxgroup": {
              "label": "Bool-Eigenschaften Auswahl",
              "description": "Durch Aktivieren oder Deaktivieren der Kontrollkästchen werden die Eigenschaften entsprechend angewandt."
            },
            "textfield": {
              "label": "Badge Inhalt"
            },
            "checkbox": {
              "label": "Icon (Ausrufezeichen)",
              "description": "Zeigt anstelle des obigen Textes ein Symbol an."
            }
          },
          "documentation": {
            "properties": {
              "color": {
                "description": "Eigenschaft um die Farben des Badges festzulegen. \nHintergrund-, Rahmen- und Textfarbe können separat eingestellt werden."
              },
              "top": {
                "description": "Eigenschaft um das Badge an der Oberseite seines Geschwisters zu positionieren."
              },
              "bottom": {
                "description": "Eigenschaft um das Badge an der Unterseite seines Geschwisters zu positionieren."
              },
              "left": {
                "description": "Eigenschaft um das Badge links von seinem Geschwister zu positionieren."
              },
              "right": {
                "description": "Eigenschaft um das Badge rechts von seinem Geschwister zu positionieren."
              },
              "text": {
                "description": "Eigenschaft um die Texteinstellungen des Badge-Inhalts festzulegen."
              },
              "border": {
                "description": "Eigenschaft um den Rand des Badges festzulegen. \nSie kann auch deaktiviert werden, indem diese Eigenschaft auf „false“ gesetzt wird."
              },
              "width": {
                "description": "Eigenschaft um die Breite des Badges festzulegen."
              },
              "height": {
                "description": "Eigenschaft um die Höhe des Badges einzustellen."
              }
            },
            "slots": {
              "referComponent": {
                "textfield": {
                  "default": "Platzhalter für die Geschwisterkomponente, auf der das Badge angebracht wird.",
                  "badgeContent": "Platzhalter für den Badge-Inhalt."
                }
              }
            }
          }
        }
      },
      "slider": {
        "content": {
          "documentation": {
            "properties": {
              "color": {
                "description": "Eigenschaft um die Farben des Sliders einzustellen. \nDer Beschreibungstext, die Slider-Linie und der Slider-Regler können separat eingestellt werden."
              },
              "label": {
                "description": "Eigenschaft um die Bezeichnung des Sliders festzulegen. \nEs kann auch vollständig angepasst werden, indem der gleichnamige Platzhalter verwendet wird."
              },
              "description": {
                "description": "Eigenschaft um die Beschreibung des Sliders festzulegen. \nEs kann auch vollständig angepasst werden, indem der gleichnamige Platzhalter verwendet wird."
              },
              "min": {
                "description": "Eigenschaft um den Mindestwert des Sliderbereichs festzulegen."
              },
              "max": {
                "description": "Eigenschaft um den Maximalwert des Sliderbereichs festzulegen."
              },
              "thumbSize": {
                "description": "Eigenschaft um die Größe des Slider-Reglers in px einzustellen."
              },
              "rounded": {
                "description": "Eigenschaft um entweder die rounded-Eigenschaft des Schiebereglers zu deaktivieren, indem Sie ihn auf „false“ setzen, oder ihn anpassen, indem Sie eine Tailwind-'rounded'-Klasse bereitstellen."
              },
              "width": {
                "description": "Eigenschaft um die Breite des Sliders einzustellen."
              },
              "height": {
                "description": "Eigenschaft um die Höhe des Sliders festzulegen."
              }
            },
            "slots": {
              "label": {
                "description": "Platzhalter zum Anpassen des Labels."
              },
              "description": {
                "description": "Platzhalter zum Anpassen der Beschreibung."
              }
            },
            "caveats": {
              "resolveConfig": {
                "title": "Tailwind-Farben in Hex-Farben auflösen",
                "description": "Da die Komponente Hex-Farben für zusätzliches benutzerdefiniertes CSS benötigt, ist es möglich die Tailwind-Farbe in einen Hex-Farbcode aufzulösen, indem man <a class='font-bold underline text-primary-800 hover:text-secondary-700' href=' verwenden. \n{url}' target='_blank'>diese Methode</a> nutzt."
              }
            }
          }
        }
      }
    }
  },
  "components": {
    "propDisplay": {
      "content": {
        "copyTooltip": "Klicken um einen direkten Link zu kopieren"
      }
    },
    "slotDisplay": {
      "content": {
        "copyTooltip": "Klicken um einen direkten Link zu kopieren"
      }
    },
    "eventDisplay": {
      "content": {
        "copyTooltip": "Klicken um einen direkten Link zu kopieren"
      }
    },
    "configDisplay": {
      "content": {
        "copyTooltip": "Klicken um einen direkten Link zu kopieren"
      }
    },
    "caveatDisplay": {
      "content": {
        "copyTooltip": "Klicken um einen direkten Link zu kopieren"
      }
    },
    "documentationDisplay": {
      "content": {
        "documentation": "Dokumentation",
        "props": "Eigenschaften",
        "events": "Ereignisse",
        "slots": "Platzhalter",
        "configs": "Konfigurationen",
        "caveats": "Vorbehalte"
      }
    }
  }
}
